driver-tests/bpelse/assign/AssignJbi/test/CopyfloatInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <floatPart>
	<xsd_float>8.5E5</xsd_float>
        <optional_float>1.9E5</optional_float>
	<repeat_float>1.9E5</repeat_float>
	<repeat_float>1.02E5</repeat_float>
   </floatPart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
